{"/getting_started":{"title":"Getting Started","data":{"":"In this guide, we will show you how to locally install and set up the Plow CLI,\nand how to take common actions (e.g. publishing a package) with it."}},"/":{"data":{"":""}},"/introduction":{"title":"Introduction","data":{"":"Plow is a package manager for ontologies, bringing established practices from software engineering\ninto the world of ontology engineering. It similar to programming language package manager such as\nnpm and cargo.Plow consists of a few distinct core components:\nthe official registry\nthe website for the official registry\nthe Command Line Interface (CLI)\n\nThe official registry is a database of packages (called fields in Plow) that is controlled via a\nJSON API. It allows anyone to publish packages for public or private consumption for any knowledge\ndomain.The registry website allows for discovery of packages via search,\ncategories and keywords. It also provides an overview of relevant metadata (ontology project website,\nlicense, dependencies, etc.) for all versions of all packages.The CLI allows for interacting with the registry from the terminal. It allows for e.g. publishing new\nfields, resolving dependencies of an ontology project and/or opening an ontology with dependencies in Protege."}},"/getting_started/installation":{"title":"Installation","data":{"":"","installing-rust-toolchain#Installing Rust toolchain":"To install the Plow CLI, currently an installation of a recent version of the Rust language toolchain\nis required.\nTo provide an easier setup process that doesn't require installing the Rust toolchain, we are working on providing pre-built binaries of the CLI.","installing-the-plow-cli-binary#Installing the Plow CLI binary":"To install the Plow CLI via cargo, you can run in a terminal:\ncargo install plow_cli\nAfter the installation is finished, you can verify that the binary is available via:\nplow --help","login-to-public-registry#Login to public registry":"In order to take certain actions with the Plow CLI (e.g. publishing a package)\nor to have access to private packages that have been shared with your Plow registry\naccount, you have to authenticate your installation of the CLI.\nLog in (or create an account) under registry.field33.com\nIn your account settings create a new User Token, and copy it to your clipboard\nIn a terminal run (substituting [USER_TOKEN] with the token from your clipboard):\nplow login [USER_TOKEN]"}}}